tap 'caskroom/cask'
tap 'homebrew/brewdler'
tap 'homebrew/dupes'

brew 'brew-cask'

# cask 'onepassword'
# cask 'android-studio'
cask 'acorn'
cask 'alfred'
cask 'atom'
cask 'bartender'
cask 'bettertouchtool'
cask 'calibre'
cask 'charles'
cask 'chromecast'
cask 'cleanmymac'
cask 'cyberduck'
cask 'daisydisk'
cask 'dash'
cask 'divvy'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'freemind'
cask 'google-chrome'
cask 'google-drive'
cask 'hipchat'
cask 'licecap'
cask 'mou'
cask 'opera'
cask 'rescuetime'
cask 'sauce'
cask 'spotify'
cask 'virtualbox'


# Brewfile

# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# Install some other useful utilities like `sponge`
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
install findutils
# Install GNU `sed`, overwriting the built-in `sed`
brew 'gnu-sed', args: ['with-default-names']
# Install Bash 4
# Note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before running `chsh`.
install bash
install bash-completion

# Install wget with IRI support
brew 'wget', args: ['with-iri']

# Install more recent versions of some OS X tools
brew 'vim', args: ['override-system-vi']
brew 'grep'
brew 'screen'


# Install other useful binaries
brew 'ack'
brew 'android-platform-tools'
brew 'autoconf'
brew 'automake'
brew 'bash'
brew 'bash-completion'
brew 'ffmpeg', args: ['with-libvpx']
brew 'findutils'
brew 'freetype'
brew 'gettext'
brew 'git'
brew 'git-extras'
brew 'imagemagick', args: ['with-webp']
brew 'jpeg'
brew 'lame'
brew 'legit'
brew 'libidn'
brew 'libpng'
brew 'libtool'
brew 'libvo-aacenc'
brew 'libvpx'
brew 'node'
brew 'openssl'
brew 'pcre'
brew 'phantomjs'
brew 'pkg-config'
brew 'pv'
brew 'readline'
brew 'rename'
brew 'texi2html'
brew 'tree'
brew 'webp'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'yasm'
brew 'zopfli'
